tensorVLV-dev/constant/thermodynamicProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermodynamicProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

barotropicCompressibilityModel linear;

psiv            2.5e-06;

rholSat         990;

psil            5e-07;

pSat            10000; //saturation pressure

rhoMin          0.001;


// ************************************************************************* //
// ************************ tensorVLV - 2025 ******************************* //
// ************************** pttensor.com ********************************* //